In [52]:
import numpy as np
import pandas as pd

df= pd.read_csv("movie_scores.csv")
print(df)

  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
1        NaN       NaN   NaN    NaN              NaN               NaN
2       Hugh   Jackman  51.0      m              NaN               NaN
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0

In [53]:
print(df.isnull())
print(df.notnull())

   first_name  last_name    age  gender  pre_movie_score  post_movie_score
0       False      False  False   False            False             False
1        True       True   True    True             True              True
2       False      False  False   False             True              True
3       False      False  False   False            False             False
4       False      False  False   False            False             False
   first_name  last_name    age  gender  pre_movie_score  post_movie_score
0        True       True   True    True             True              True
1       False      False  False   False            False             False
2        True       True   True    True            False             False
3        True       True   True    True             True              True
4        True       True   True    True             True              True

In [54]:
print(df["first_name"])
print(df[df['first_name'].notnull()])

0      Tom
1      NaN
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object
  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
2       Hugh   Jackman  51.0      m              NaN               NaN
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0

In [55]:
print(df[(df['pre_movie_score'].isnull()) & df["gender"].notnull()])

  first_name last_name   age gender  pre_movie_score  post_movie_score
2       Hugh   Jackman  51.0      m              NaN               NaN

In [56]:
print(df.dropna())

  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0

In [57]:
print(df.dropna(thresh=1))

  first_name last_name   age gender  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0      m              8.0              10.0
2       Hugh   Jackman  51.0      m              NaN               NaN
3      Oprah   Winfrey  66.0      f              6.0               8.0
4       Emma     Stone  31.0      f              7.0               9.0

In [58]:
print(df.dropna(axis=1))

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [59]:
print(df.dropna(thresh=4,axis=1))

  first_name last_name   age gender
0        Tom     Hanks  63.0      m
1        NaN       NaN   NaN    NaN
2       Hugh   Jackman  51.0      m
3      Oprah   Winfrey  66.0      f
4       Emma     Stone  31.0      f

In [60]:
df.fillna("NEW VALUE")

  first_name  last_name        age     gender pre_movie_score post_movie_score
0        Tom      Hanks       63.0          m             8.0             10.0
1  NEW VALUE  NEW VALUE  NEW VALUE  NEW VALUE       NEW VALUE        NEW VALUE
2       Hugh    Jackman       51.0          m       NEW VALUE        NEW VALUE
3      Oprah    Winfrey       66.0          f             6.0              8.0
4       Emma      Stone       31.0          f             7.0              9.0

In [61]:
print(df["first_name"].fillna("Empty"))
df["first_name"]=df["first_name"].fillna("Empty")

0      Tom
1    Empty
2     Hugh
3    Oprah
4     Emma
Name: first_name, dtype: object

In [62]:
print(df["pre_movie_score"].mean())
df["pre_movie_score"].fillna(df["pre_movie_score"].mean())

7.0

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [63]:
df= pd.read_csv("tips.csv")
print(df)
df_grouped=df.groupby("gender")
print(df_grouped)

     total_bill   tip  gender smoker   day    time  size  price_per_person  \
0         16.99  1.01  Female     No   Sun  Dinner     2              8.49
1         10.34  1.66    Male     No   Sun  Dinner     3              3.45
2         21.01  3.50    Male     No   Sun  Dinner     3              7.00
3         23.68  3.31    Male     No   Sun  Dinner     2             11.84
4         24.59  3.61  Female     No   Sun  Dinner     4              6.15
..          ...   ...     ...    ...   ...     ...   ...               ...
239       29.03  5.92    Male     No   Sat  Dinner     3              9.68
240       27.18  2.00  Female    Yes   Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes   Sat  Dinner     2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name     CC Number Payment ID
0    Christy Cunningham  3.560330e+15    Sun2959
1        Douglas Tucker  4.478070e+15    Sun4608
2        Travis Walters  6.011810e+15    Sun4458
3      Nathaniel Harris  4.676140e+15    Sun5260
4          Tonya Carter  4.832730e+15    Sun2251
..                  ...           ...        ...
239       Michael Avila  5.296070e+15    Sat2657
240      Monica Sanders  3.506810e+15    Sat1766
241          Keith Wong  6.011890e+15    Sat3880
242        Dennis Dixon  4.375220e+12      Sat17
243     Michelle Hardin  3.511450e+15    Thur672

[244 rows x 11 columns]
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002433C461C50>

In [64]:
mean_tip_by_gender= df_grouped["tip"].mean()
print(mean_tip_by_gender)

gender
Female    2.833448
Male      3.089618
Name: tip, dtype: float64

In [65]:
print(df_grouped["tip"].min())
print(df_grouped["tip"].max())
print(df_grouped["tip"].std())
print(df_grouped["tip"].var())
print(df_grouped["tip"].count())
print(df_grouped["tip"].sum())

gender
Female    1.0
Male      1.0
Name: tip, dtype: float64
gender
Female     6.5
Male      10.0
Name: tip, dtype: float64
gender
Female    1.159495
Male      1.489102
Name: tip, dtype: float64
gender
Female    1.344428
Male      2.217424
Name: tip, dtype: float64
gender
Female     87
Male      157
Name: tip, dtype: int64
gender
Female    246.51
Male      485.07
Name: tip, dtype: float64

In [66]:
df_grouped=df.groupby(["gender","day"]).agg({"tip" : ["mean","sum"]}).reset_index()
print(df_grouped)

   gender   day       tip
                     mean     sum
0  Female   Fri  2.781111   25.03
1  Female   Sat  2.801786   78.45
2  Female   Sun  3.367222   60.61
3  Female  Thur  2.575625   82.42
4    Male   Fri  2.693000   26.93
5    Male   Sat  3.083898  181.95
6    Male   Sun  3.220345  186.78
7    Male  Thur  2.980333   89.41

In [67]:
df_grouped.columns = ["gender","day","mean_tip","total_tip"]
print(df_grouped.head())

   gender   day  mean_tip  total_tip
0  Female   Fri  2.781111      25.03
1  Female   Sat  2.801786      78.45
2  Female   Sun  3.367222      60.61
3  Female  Thur  2.575625      82.42
4    Male   Fri  2.693000      26.93

In [78]:
data_one={"A":["A0","A1","A2","A3"],"B":["B0","B1","B2","B3"]}
data_two={"C":["C0","C1","C2","C3"],"D":["D0","D1","D2","D3"]}
one=pd.DataFrame(data_one)
two=pd.DataFrame(data_two)
print(one)
print(two)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [82]:
axis0=pd.concat([one,two],axis=0).reset_index().drop(['index'], axis=1)
print(axis0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
4  NaN  NaN   C0   D0
5  NaN  NaN   C1   D1
6  NaN  NaN   C2   D2
7  NaN  NaN   C3   D3

In [70]:
axis0=pd.concat([one,two],axis=0)
print(axis0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [35]:
axis1=pd.concat([one,two],axis=1)
print(axis1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [36]:
two.columns=one.columns
print(pd.concat([one,two]))

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [39]:
one.columns=two.columns
print(pd.concat([one,two]))

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [41]:
registrations=pd.DataFrame({'reg_id':[1,2,3,4],'name':['Alice','Bob','Carol','Dave']})
logins=pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Alice','Yolando','Bob']})
print(registrations)
print(logins)

   reg_id   name
0       1  Alice
1       2    Bob
2       3  Carol
3       4   Dave
   log_id     name
0       1   Xavier
1       2    Alice
2       3  Yolando
3       4      Bob

In [42]:
merged_df=pd.merge(registrations,logins,how='inner',on='name')
print(merged_df)

   reg_id   name  log_id
0       1  Alice       2
1       2    Bob       4

In [43]:
merged_df=pd.merge(registrations,logins,how='inner')
print(merged_df)

   reg_id   name  log_id
0       1  Alice       2
1       2    Bob       4

In [49]:
#pd.merge(registrations,logins,how='inner',on='reg_id')
merged_df=pd.merge(registrations,logins,how='right')
print(merged_df)

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0    Alice       2
2     NaN  Yolando       3
3     2.0      Bob       4

In [50]:
merged_df=pd.merge(registrations,logins,how='left')
print(merged_df)

   reg_id   name  log_id
0       1  Alice     2.0
1       2    Bob     4.0
2       3  Carol     NaN
3       4   Dave     NaN

In [51]:
merged_df=pd.merge(registrations,logins,how='outer')
print(merged_df)

   reg_id     name  log_id
0     1.0    Alice     2.0
1     2.0      Bob     4.0
2     3.0    Carol     NaN
3     4.0     Dave     NaN
4     NaN   Xavier     1.0
5     NaN  Yolando     3.0